In [42]:
import mysql.connector
from mysql.connector import Error
import pandas as pd
from dotenv import load_dotenv

In [43]:
load_dotenv('.env')
%env pw = Password

env: pw=Password

In [44]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

In [45]:
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

In [46]:
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

In [47]:
create_database_query = "CREATE DATABASE library"
create_database(connection, create_database_query)
db = "library"

Database created successfully

In [48]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

In [49]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

In [50]:
create_person_table = """
CREATE TABLE person (
  ssn INT PRIMARY KEY,
  first_name VARCHAR(40) NOT NULL,
  last_name VARCHAR(40) NOT NULL,
  address VARCHAR(40) NOT NULL,
  position VARCHAR(40) NOT NULL,
  phone_no VARCHAR(20)
  );
 """

create_member_table = """
CREATE TABLE member (
  id INT PRIMARY KEY,
  expiration DATE
);
 """

create_person_borrowing_table = """
CREATE TABLE person_borrowing (
  ssn INT,
  id INT,
  isbn INT,
  PRIMARY KEY (ssn, id, isbn),
  FOREIGN KEY (ssn) REFERENCES person(ssn),
  FOREIGN KEY (id) REFERENCES member(id),
  FOREIGN KEY (isbn) REFERENCES book(isbn)
);
"""

create_book_table = """
CREATE TABLE book (
  isbn INT PRIMARY KEY,
  description VARCHAR(255),
  title VARCHAR(255) NOT NULL,
  author VARCHAR(255) NOT NULL,
  genre VARCHAR(255) NOT NULL,
  edition INT NOT NULL,
  language VARCHAR(40) NOT NULL,
  copies_available INT NOT NULL,
  kind VARCHAR(255),
  lendable BOOLEAN NOT NULL DEFAULT 0
);
"""

create_borrowed_book_table = """
CREATE TABLE borrowed_book (
  id INT,
  isbn INT,
  check_out_date DATE,
  return_date DATE,
  PRIMARY KEY (id, isbn, check_out_date),
  FOREIGN KEY (id) REFERENCES member(id),
  FOREIGN KEY (isbn) REFERENCES book(isbn)
);
"""


connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_person_table)
execute_query(connection, create_member_table)
execute_query(connection, create_book_table)
execute_query(connection, create_borrowed_book_table)
execute_query(connection, create_person_borrowing_table)

MySQL Database connection successful
Query successful
Query successful
Query successful
Query successful
Query successful

In [51]:
pop_person = '''
INSERT INTO person (ssn, first_name, last_name, address, position, phone_no)
VALUES
(111111111, 'John', 'Doe', '123 Main St', 'Librarian', '+12345678901'),
(222222222, 'Jane', 'Smith', '456 Oak St', 'Student', '+98765432109'),
(333333333, 'Alice', 'Johnson', '789 Pine St', 'Librarian', '+87654321098'),
(444444444, 'David', 'Miller', '567 Elm St', 'Student', '+11223344556'),
(555555555, 'Emma', 'Lee', '890 Maple St', 'Librarian', '+99887766554'),
(666666666, 'Brian', 'Anderson', '432 Birch St', 'Student', '+66778899001'),
(777777777, 'Olivia', 'Brown', '345 Cedar St', 'Librarian', '+11223344557'),
(888888888, 'Michael', 'Taylor', '678 Pine St', 'Student', '+66778899002'),
(999999999, 'Sophia', 'Davis', '987 Oak St', 'Librarian', '+99887766555'),
(101010101, 'Ethan', 'White', '234 Maple St', 'Student', '+11223344558');
'''

pop_person_borrowing = '''
INSERT INTO person_borrowing (ssn, id, isbn)
VALUES
(111111111, 1, 987654321),
(222222222, 2, 123456789),
(333333333, 3, 456789012),
(444444444, 4, 234567890),
(555555555, 5, 567890123),
(666666666, 6, 890123456),
(777777777, 7, 123789456),
(888888888, 8, 456012378),
(999999999, 9, 789345012),
(101010101, 10, 123456789);

'''

pop_member = '''
INSERT INTO member (id, expiration)
VALUES
(1, '2024-12-31'),
(2, '2023-11-15'),
(3, '2024-06-30'),
(4, '2023-12-15'),
(5, '2023-10-20'),
(6, '2024-01-10'),
(7, '2023-09-05'),
(8, '2024-03-22'),
(9, '2023-08-18'),
(10, '2024-02-01'),
(11, '2024-02-01');
'''

pop_book = '''
INSERT INTO book (isbn, description, title, author, genre, edition, language, copies_available, kind, lendable)
VALUES
(987654321, 'Science Fiction book', 'The Galactic Adventure', 'John Writer', 'Science Fiction', 1, 'English', 5, 'Paperback', true),
(123456789, 'Mystery book', 'The Enigma Code', 'Jane Author', 'Mystery', 2, 'French', 3, 'Hardcover', true),
(456789012, 'Fantasy book', 'The Magical Land', 'Alice Novelist', 'Fantasy', 3, 'Spanish', 7, 'E-book', true),
(234567890, 'Adventure book', 'The Quest for Gold', 'David Explorer', 'Adventure', 1, 'German', 2, 'Paperback', true),
(567890123, 'History book', 'Ancient Civilizations', 'Emma Historian', 'History', 2, 'Russian', 6, 'Hardcover', true),
(890123456, 'Romance book', 'Love Under the Moonlight', 'Brian Romantic', 'Romance', 1, 'Italian', 4, 'E-book', true),
(123789456, 'Biography book', 'Journey of a Visionary', 'Olivia Biographer', 'Biography', 3, 'French', 3, 'Paperback', true),
(456012378, 'Thriller book', 'Chasing Shadows', 'Michael Thriller', 'Thriller', 2, 'Spanish', 8, 'Hardcover', true),
(789345012, 'Science book', 'The Wonders of Universe', 'Sophia Scientist', 'Science', 1, 'English', 5, 'E-book', true),
(123456755, 'Comedy book', 'Laugh Out Loud', 'Ethan Comedian', 'Comedy', 1, 'German', 4, 'Paperback', true);

'''

pop_borrowed_book = '''
INSERT INTO borrowed_book (id, isbn, check_out_date, return_date)
VALUES
(1, 987654321, '2023-12-01', '2023-12-15'),
(2, 123456789, '2023-11-15', '2023-11-30'),
(3, 456789012, '2023-10-01', '2023-10-15'),
(4, 234567890, '2023-09-15', '2023-09-30'),
(5, 567890123, '2023-08-01', '2023-08-15'),
(6, 890123456, '2023-07-15', '2023-07-30'),
(7, 123789456, '2023-06-01', '2023-06-15'),
(8, 456012378, '2023-05-15', '2023-05-30'),
(9, 789345012, '2023-04-01', '2023-04-15'),
(10, 123456789, '2023-03-15', '2023-03-30');

'''

connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, pop_person)
execute_query(connection, pop_book)
execute_query(connection, pop_member)
execute_query(connection, pop_person_borrowing)
execute_query(connection, pop_borrowed_book)

MySQL Database connection successful
Query successful
Query successful
Query successful
Query successful
Query successful

In [52]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [53]:
q1 = """
SELECT *
FROM person;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)

for result in results:
  print(result)

MySQL Database connection successful
(101010101, 'Ethan', 'White', '234 Maple St', 'Student', '+11223344558')
(111111111, 'John', 'Doe', '123 Main St', 'Librarian', '+12345678901')
(222222222, 'Jane', 'Smith', '456 Oak St', 'Student', '+98765432109')
(333333333, 'Alice', 'Johnson', '789 Pine St', 'Librarian', '+87654321098')
(444444444, 'David', 'Miller', '567 Elm St', 'Student', '+11223344556')
(555555555, 'Emma', 'Lee', '890 Maple St', 'Librarian', '+99887766554')
(666666666, 'Brian', 'Anderson', '432 Birch St', 'Student', '+66778899001')
(777777777, 'Olivia', 'Brown', '345 Cedar St', 'Librarian', '+11223344557')
(888888888, 'Michael', 'Taylor', '678 Pine St', 'Student', '+66778899002')
(999999999, 'Sophia', 'Davis', '987 Oak St', 'Librarian', '+99887766555')

In [39]:
update = """
UPDATE person 
SET address = '23 Fingiertweg, 14534 Berlin' 
WHERE ssn = 101010101;
"""

connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update)

MySQL Database connection successful
Query successful

In [54]:
q1 = """
SELECT *
FROM person;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)

for result in results:
  print(result)

MySQL Database connection successful
(101010101, 'Ethan', 'White', '23 Fingiertweg, 14534 Berlin', 'Student', '+11223344558')
(111111111, 'John', 'Doe', '123 Main St', 'Librarian', '+12345678901')
(222222222, 'Jane', 'Smith', '456 Oak St', 'Student', '+98765432109')
(333333333, 'Alice', 'Johnson', '789 Pine St', 'Librarian', '+87654321098')
(444444444, 'David', 'Miller', '567 Elm St', 'Student', '+11223344556')
(555555555, 'Emma', 'Lee', '890 Maple St', 'Librarian', '+99887766554')
(666666666, 'Brian', 'Anderson', '432 Birch St', 'Student', '+66778899001')
(777777777, 'Olivia', 'Brown', '345 Cedar St', 'Librarian', '+11223344557')
(888888888, 'Michael', 'Taylor', '678 Pine St', 'Student', '+66778899002')
(999999999, 'Sophia', 'Davis', '987 Oak St', 'Librarian', '+99887766555')

In [55]:
delete_course = """
DELETE FROM member 
WHERE id = 11;
"""

connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_course)

MySQL Database connection successful
Query successful

In [56]:
q1 = """
SELECT *
FROM member;
"""

connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)

for result in results:
  print(result)

MySQL Database connection successful
(1, datetime.date(2024, 12, 31))
(2, datetime.date(2023, 11, 15))
(3, datetime.date(2024, 6, 30))
(4, datetime.date(2023, 12, 15))
(5, datetime.date(2023, 10, 20))
(6, datetime.date(2024, 1, 10))
(7, datetime.date(2023, 9, 5))
(8, datetime.date(2024, 3, 22))
(9, datetime.date(2023, 8, 18))
(10, datetime.date(2024, 2, 1))